{
	"page": 1,
	"page_count": 213,
	"items_per_page": 20,
	"took": 10,
	"timed_out": false,
	"total": 4249,
	"results": [
		{
			"contents": "<p>Autonomy, cutting-edge technology, and talented teams are some of the reasons engineering leaders enjoy working at Facebook. Our bottom up culture is a cornerstone of how we work, and our empowered engineers are solving technical challenges at an unprecedented scale. As an engineering manager you will support, enable and empower your team, managing high-performing engineers to make a meaningful impact on billions of people around the world.We opened our first office in London in 2007. Since then, the UK has played a central role in the development of some of our global products. London is our biggest engineering hub outside the US, and we build and ship products that serve billions of people from our central London locations. Facebook is in search of the world's most creative and experienced engineering leaders. We embrace entrepreneurs as well as those who come from more established organisations. Software Engineering Managers are clearly characterised by progressive technical experience and demonstrated progression in management responsibility. You have also kept your coding skills sharp and bring an unwavering passion for managing the dynamics of a fast-paced environment.Competitive Salary including the following benefits apply:Medical BenefitsDental BenefitsVision BenefitsPension BenefitsLife AssuranceChildcare BenefitsGym BenefitsTransport benefitsLaundry Benefit<ul><li>Be both highly technical and an effective people manager in the mobile domain</li><li>Lead teams that deliver on multiple projects of increasing dependencies in an ambiguous or high-impact area</li><li>Work with your team and XFN partners to define and influence strategy</li><li>Drive roadmap creation and execution</li><li>Collaborate with various functions, drive engineering initiatives and have an impact at an organisational level</li><li>Participate in technical design</li><li>Measure the impact of your team and set clear expectations and goals</li><li>Work effectively with XFN partners and stakeholders to set and achieve optimal outcomes</li><li>Partner with leadership to influence and drive org design, contribution and prioritization</li></ul><ul><li>Proven track record of supporting technical teams</li><li>Strong problem solving skills and background in coding</li><li>Demonstrated ability to manage technical teams</li><li>Knowledge of growing teams and/or organisations</li><li>Experience supporting mobile engineering teams</li><li>BS / MS in Computer Science (In lieu of degree, relevant work experience)</li></ul>Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.</p>",
			"name": "Manager, Software Engineering (Mobile)",
			"type": "external",
			"publication_date": "2022-01-29T23:12:17Z",
			"short_name": "manager-software-engineering-mobile-2ea942",
			"model_type": "jobs",
			"id": 7279545,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [
				{
					"name": "Fortune 1000",
					"short_name": "fortune-1000-companies"
				}
			],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/meta/manager-software-engineering-mobile-2ea942"
			},
			"company": {
				"id": 659,
				"short_name": "meta",
				"name": "Meta"
			}
		},
		{
			"contents": "<p><b>Job Description</b><br>Enterprise Digital seeks to change the way individuals manage their healthcare by focusing on the features that matter to our customers, building software in a modern, lean way, and deploying continuously into the cloud. As the team building out provider search APIs, we seek help our members effectively find the care they need.<br><br>What You'll Do<br>Our server teams focus on software that supports our provider search and pricing APIs used by millions of our members. Our engineers work to build new features, standup new services, and refactor existing services to bring greater stability and scalability to our APIs. <br><br>In any given day you will:<br>•  Contribute code and tests according to criteria established by our product and engineering teams <br>•  Work with Product to break down and plan sprint work to help us achieve our long-term goals <br>•  Monitor, troubleshoot, and support our applications in production<br>•  Seek opportunities to improve our code and delivery pipelines <br>•  Learn new software development skills, engineering practices, and cloud engineering tools <br><br>This role can be based in one of our corporate offices or can be fully remote within US.<br><br><b>Required Qualifications</b><br><em> 5+ years software development experience <br></em> 3+ years API development experience<br><br><b>COVID Requirements</b><br>CVS Health requires its Colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, or religious belief that prevents them from being vaccinated.<br><br>If you are vaccinated, you are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status within the first 10 days of your employment. For the two COVID-19 shot regimen, you will be required to provide proof of your second COVID-19 shot within the first 45 days of your employment. In some states and roles, you may be required to provide proof of full vaccination before you can begin to actively work. Failure to provide timely proof of your COVID-19 vaccination status will result in the termination of your employment with CVS Health.<br><br>If you are unable to be fully vaccinated due to disability, medical condition, or religious belief, you will be required to apply for a reasonable accommodation within the first 10 days of your employment in order to remain employed with CVS Health. As a part of this process, you will be required to provide information or documentation about the reason you cannot be vaccinated. In some states and roles, you may be required to have an approved reasonable accommodation before you can begin to actively work. If your request for an accommodation is not approved, then your employment may be terminated.<br><br><b>Preferred Qualifications</b><br><em> Experience deploying and maintaining cloud-based services, specifically on AWS. <br></em> Experience with our current stack (Node / Ruby, ECS, Docker, Elasticsearch, Postgres) <br><em> Experience deploying and maintaining micro services in production serving millions of users <br></em> Experience translating large features into software designs<br><em> Willingness to communicate across delivery teams about organizational objectives<br></em> An open mind about different solutions and a willingness to discuss alternatives<br>* Willingness to actively mentor junior developers<br><br><b>Education</b><br>Bachelor's degree or equivalent combination of education and years of experience.<br><br><b>Business Overview</b><br>At CVS Health, we are joined in a common purpose: helping people on their path to better health. We are working to transform health care through innovations that make quality care more accessible, easier to use, less expensive and patient-focused. Working together and organizing around the individual, we are pioneering a new approach to total health that puts people at the heart. <br> <br>We strive to promote and sustain a culture of diversity, inclusion and belonging every day. CVS Health is an equal opportunity and affirmative action employer. We do not discriminate in recruiting, hiring or promotion based on race, ethnicity, sex/gender, sexual orientation, gender identity or expression, age, disability or protected veteran status or on any other basis or characteristic prohibited by applicable federal, state, or local law. We proudly support and encourage people with military experience (active, veterans, reservists and National Guard) as well as military spouses to apply for CVS Health job opportunities.</p>",
			"name": "Senior Backend Nodejs Engineer",
			"type": "external",
			"publication_date": "2022-01-29T11:58:06Z",
			"short_name": "senior-backend-nodejs-engineer-e3509c",
			"model_type": "jobs",
			"id": 7404193,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/cvshealth/senior-backend-nodejs-engineer-e3509c"
			},
			"company": {
				"id": 12096,
				"short_name": "cvshealth",
				"name": "CVS Health"
			}
		},
		{
			"contents": "<p>Every month, billions of people leverage Meta products to connect with friends and loved ones from across the world. On the Data Engineering team, our mission is to support these products both internally and externally by delivering the best data foundation that drives impact through informed decision making. As a highly collaborative organization, our data engineers work cross-functionally with software engineering, data science, and product management to optimize growth, strategy, and experience for our 3 billion plus users, as well as our internal employee community. In this role, you will see a direct correlation between your work, company growth, and user satisfaction. Beyond this, you will work with some of the brightest minds in the industry, and you'll have a unique opportunity to solve some of the most interesting data challenges around efficiency and integrity, at a scale few companies can match. As we continue to expand and create, we have a lot of exciting work ahead of us!<ul><li>Manage and execute data warehouse plans for a product or a group of products to solve well-scoped problems.</li><li>Identify the data needed for a business problem and implement logging required to ensure availability of data, while working with data infrastructure to triage issues and resolve.</li><li>Collaborate with engineers, product managers and data scientists to understand data needs, representing key data insights visually in a meaningful way.</li><li>Build data expertise and leverage data controls to ensure privacy, security, compliance, data quality, and operations for allocated areas of ownership.</li><li>Design, build and launch new data models and visualizations in production, leveraging common development toolkits.</li><li>Independently design, build and launch new data extraction, transformation and loading processes in production, mentoring others around creating efficient queries.</li><li>Support existing processes running in production and implement optimized solutions with limited guidance.</li><li>Define and manage SLA for data sets in allocated areas of ownership.</li></ul><ul><li>Bachelor's degree (BA or BS) or equivalent</li><li>A minimum of 2 years of work experience in data engineering (minimum of 1 years with a Ph.D.)</li><li>Experience with SQL, ETL, data modelling and at least one programming language (e.g., Python, C++, C#, Scala)</li></ul><ul><li>Masters or Ph.D. degree in a STEM field</li><li>Experience with one or more of the following: data processing automation, data quality, data warehousing, data governance, business intelligence, data visualization, data privacy</li><li>Experience working with TB to PB scale data</li></ul>Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.</p>",
			"name": "Data Engineer, Product Analytics",
			"type": "external",
			"publication_date": "2022-01-29T23:09:28Z",
			"short_name": "data-engineer-product-analytics-665324",
			"model_type": "jobs",
			"id": 7981942,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Mid Level",
					"short_name": "mid"
				}
			],
			"tags": [
				{
					"name": "Fortune 1000",
					"short_name": "fortune-1000-companies"
				}
			],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/meta/data-engineer-product-analytics-665324"
			},
			"company": {
				"id": 659,
				"short_name": "meta",
				"name": "Meta"
			}
		},
		{
			"contents": "<p><strong>Democratize Access To Credit </strong><br> <br> Together we'll dismantle barriers to housing for working families to use data to eliminate the racial wealth gap. The ability to build credit from rental payments has the potential to give over 45 million renters with little to no credit a pathway into the financial system. Those individuals then stand to save over $200,000 in reduced lifetime interest payments, build home equity by qualifying for mortgages, and build wealth by passing job screening requirements. The transformational impact of this cannot be understated.<br><br><strong>Engineering Team</strong><br> <br> We are building a team of changemakers. It is not enough to have the intention to do good - Esusu engineers translate intent into action. We believe that accomplishing our ambitious goals cannot be done by lone heroes. Lasting change requires work by synergistic teams, and we look for Engineers who are highly skilled at collaboration. .<br><br><strong>The challenge</strong><br> <br> We are seeking an experienced Software Engineer to join Esusu as a team lead and play a pivotal role in the future growth of our company. You will be responsible for leading the team that develops our consumer facing mobile and web applications which enable users to sign up for rent-reporting and access additional financial services. <br> <br> More tactically, you will have the opportunity to own key development features across multiple lines of business while implementing best-in-class security standards to protect customer data and managing direct reports. This will require the ability to jump in the weeds of writing code, planning for scale, and the capability to think from a product-oriented perspective. This role will report to the company's Director of Product Engineering and work with the rest of the engineering team.<br><br><strong>What you will help us deliver</strong><ul> <li> You will lead the technical design of our web and mobile applications. Specifically, you will be responsible for architecting how to implement features in these applications off of our product backlog. </li> <li> You will mentor other developers on the team in their work. </li> <li> You will interface with product and business stakeholders to develop the product roadmap of our consumer facing services. </li> </ul><strong>Core competencies we are hiring for </strong><ul> <li> Superb programming and software development skills - You can independently devise and implement solutions to problems with minimal explanation needed. </li> </ul> <ul> <li> Strong communication skills - You can efficiently translate between technical and non-technical audiences and have strong writing skills. </li> <li> Heart of a teacher - You are a capable mentor, able to empower and inspire others on your team. </li> </ul><strong>Basic Qualifications</strong><ul> <li> 5+ years of engineering work experience </li> <li> Expertise in frontend and backend Javascript and Typescript development </li> <li> Experience building mobile applications using cross-platform ( React native, flutter) and native (Swift/Kotlin) tooling. </li> <li> Experience delivering solutions in Agile environments </li> </ul><strong>Above and beyond</strong><ul> <li> Experience building cross-platform fintech applications, particularly working on teams that maintain apps for multiple platforms. </li> </ul><strong>Benefits</strong><ul> <li> Competitive Salary - for Seed/Series A startup </li> <li> Restricted Stock Units (RSU) </li> <li> Full Medical, Dental, Vision Insurance </li> <li> Fitness/Gym Stipend </li> <li> Commuter Benefits </li> <li> Paid Parental Leave </li> <li> Remote Work Friendly - While you may need to come into the office on certain days, we trust you to manage your work and deliverables. As long as quality work is being done, you can choose the environment that works for you. </li> <li> Flexible PTO Policy </li> <li> Mission driven company with strong culture </li> </ul><strong>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.</strong> <br> <br><strong> © Esusu Inc. All rights reserved, Esusu is proud to be an equal opportunity workplace. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate on the basis of race, religion, color, gender identity, sexual orientation, age, disability, veteran status, or other applicable legally protected characteristics. We encourage people of different backgrounds, experiences, abilities, and perspectives to apply. </strong></p>",
			"name": "Staff Software Engineer (Team Lead - Consumer Platform)",
			"type": "external",
			"publication_date": "2022-01-12T12:40:23Z",
			"short_name": "staff-software-engineer-team-lead-consumer-platform",
			"model_type": "jobs",
			"id": 7845625,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/esusufinancialinc/staff-software-engineer-team-lead-consumer-platform"
			},
			"company": {
				"id": 12117,
				"short_name": "esusufinancialinc",
				"name": "Esusu Financial, Inc."
			}
		},
		{
			"contents": "<p>Facebook is seeking an experienced Software Engineer to join the Software Engineering (Infrastructure) team. The Software Engineering (Infrastructure) team builds large distributed components that run Facebook. Our code serves millions of requests per second and it does so with sub-second latency and in a fault tolerant manner. We handle everything from Facebook scale data storage, to synchronization and coordination of large server clusters, to providing a runtime environment for front end Facebook code. We are looking for candidates who share a passion for tackling complexity and building platforms that can scale through multiple orders of magnitude.<ul><li>Design core, backend software components</li><li>Code using primarily C/C++, Java, PHP and Hack</li><li>Interface with other teams to incorporate their innovations and vice versa</li><li>Conduct design and code reviews</li><li>Analyze and improve efficiency, scalability, and stability of various system resources</li></ul><ul><li>Experience in either C/C++, Java, PHP and Hack or other relevant coding languages</li><li>Relevant experience building large-scale infrastructure applications or similar experience</li><li>Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment</li></ul><ul><li>BSc or MSc in Computer Science or related field (or equivalent industry experience)</li><li>Experience with operating system internals, filesystems, programming language design, compilers</li></ul>Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.</p>",
			"name": "Software Engineer, Infrastructure",
			"type": "external",
			"publication_date": "2022-01-29T23:12:17Z",
			"short_name": "software-engineer-infrastructure-1d2c7c",
			"model_type": "jobs",
			"id": 7384294,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Mid Level",
					"short_name": "mid"
				}
			],
			"tags": [
				{
					"name": "Fortune 1000",
					"short_name": "fortune-1000-companies"
				}
			],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/meta/software-engineer-infrastructure-1d2c7c"
			},
			"company": {
				"id": 659,
				"short_name": "meta",
				"name": "Meta"
			}
		},
		{
			"contents": "<p><b>Job Description</b><br>CVS Health Enterprise Digital seeks to change the way individuals manage their healthcare by focusing on the features that matter to our customers, building software in a modern, lean way, and deploying continuously into the cloud. As part of an engineering team building the Aetna Health website, we help our members effectively find the care they need.<br><br>What You'll Do<br>The web teams are responsible for building the best experience possible for the millions of members using our Aetna Health website. You will work alongside other engineers and with the product and design teams to consistently deliver new features. You will also work to refactor existing code in order to bring greater stability and scalability for our application as our membership continues to increase.<br><br>In any given day you will:<br>--Contribute code and tests according to criteria established by our product team<br>--Monitor, troubleshoot, and support our application in production<br>--Seek opportunities to enhance the stability, performance, maintainability, and extensibility of our application<br><br>This job can be remotely based anywhere in the U.S.<br><br><b>Required Qualifications</b><br>3+ years of professional experience with modern web frameworks, at least some of which is in ReactJS and Redux<br><br><b>COVID Requirements</b><br>CVS Health requires its Colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, or religious belief that prevents them from being vaccinated.<br><br>If you are vaccinated, you are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status within the first 10 days of your employment. For the two COVID-19 shot regimen, you will be required to provide proof of your second COVID-19 shot within the first 45 days of your employment. In some states and roles, you may be required to provide proof of full vaccination before you can begin to actively work. Failure to provide timely proof of your COVID-19 vaccination status will result in the termination of your employment with CVS Health.<br><br>If you are unable to be fully vaccinated due to disability, medical condition, or religious belief, you will be required to apply for a reasonable accommodation within the first 10 days of your employment in order to remain employed with CVS Health. As a part of this process, you will be required to provide information or documentation about the reason you cannot be vaccinated. In some states and roles, you may be required to have an approved reasonable accommodation before you can begin to actively work. If your request for an accommodation is not approved, then your employment may be terminated.<br><br><b>Preferred Qualifications</b><br>--Knowledge of accessibility in web applications <br>--Knowledge of Continuous Integration tools such as Jenkins or CircleCI<br>--Proficient with JavaScript, HTML, CSS<br>--Experience writing unit tests<br>--Experience translating large features into software design Familiarity with Agile/SAFe software development principles<br>--Familiarity using RESTful APIs<br>--Strong communication skills<br><br><b>Education</b><br>--Bachelor's degree or equivalent combination of education and years of experience.<br><br><b>Business Overview</b><br>At CVS Health, we are joined in a common purpose: helping people on their path to better health. We are working to transform health care through innovations that make quality care more accessible, easier to use, less expensive and patient-focused. Working together and organizing around the individual, we are pioneering a new approach to total health that puts people at the heart. <br> <br>We strive to promote and sustain a culture of diversity, inclusion and belonging every day. CVS Health is an equal opportunity and affirmative action employer. We do not discriminate in recruiting, hiring or promotion based on race, ethnicity, sex/gender, sexual orientation, gender identity or expression, age, disability or protected veteran status or on any other basis or characteristic prohibited by applicable federal, state, or local law. We proudly support and encourage people with military experience (active, veterans, reservists and National Guard) as well as military spouses to apply for CVS Health job opportunities.</p>",
			"name": "ReactJS Frontend Web Developer",
			"type": "external",
			"publication_date": "2022-01-29T11:54:08Z",
			"short_name": "reactjs-frontend-web-developer-056180",
			"model_type": "jobs",
			"id": 7967978,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Mid Level",
					"short_name": "mid"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/cvshealth/reactjs-frontend-web-developer-056180"
			},
			"company": {
				"id": 12096,
				"short_name": "cvshealth",
				"name": "CVS Health"
			}
		},
		{
			"contents": "<p><b>DESCRIPTION</b><br><br> Rendering Technologies is one of the fastest growing organizations in Amazon's Consumer business, chartered with creating the services and developer tooling used to build mobile applications and website experiences millions of Amazon shoppers use every day, all over the world. The rendering services and developer experiences we build empower thousands of Amazon developers to innovate with the latest reactive and declarative programming patterns and Java frameworks.<br><br>The technologies our team delivers are changing how Amazon developers work for the next 10 years!<br><br>Rendering Technologies is seeking a Software Development Engineer (SDE) to work reduced time (30hrs/week) and develop features and fixes to Amazon's most used Java development framework. The right candidate will possess a strong Java development background, and has experience developing production quality code on a regular cadence. As a reduced time (30hrs/week) Software Development Engineer, you will develop new features in Java, make regular security and maintenance updates to vulnerabilities in the Java framework, and develop new testing automation to reduce the total cost of maintaining the Java development framework.<br><br>Amazon Managers and Software Engineers working reduced time (30hrs/week) schedules must be able to relentlessly prioritize work and make high judgement calls every day on where they spend their time and energy. If you are looking for a role that prioritizes code over meetings, and requires a laser focus on shipping to our customers, this is your opportunity!<br><br>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br><br> <b>BASIC QUALIFICATIONS</b> <br><br> •  Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design<br>•  1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems.<br>•  2+ years of non-internship professional software development experience<br><br> <b>PREFERRED QUALIFICATIONS </b> <br><br> •  Master's degree in Computer Science, Computer Engineering related technical discipline<br>•  Demonstrated ability to learn new technologies quickly<br>•  Ideally 3+ years of relevant engineering experience in Java<br>•  Experience driving complex, cross-organizational projects<br>•  Development experience with agile/SCRUM methodology</p>",
			"name": "Software Engineer",
			"type": "external",
			"publication_date": "2021-12-11T13:09:11Z",
			"short_name": "software-engineer-91f97f",
			"model_type": "jobs",
			"id": 7636466,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/amazon/software-engineer-91f97f"
			},
			"company": {
				"id": 12090,
				"short_name": "amazon",
				"name": "Amazon"
			}
		},
		{
			"contents": "<p><strong>Staff Software Engineer</strong></p>\n\n<p><span>The File-Based Recognition (FBR) team delivers innovative Big Data solutions to fulfill important identity resolution use cases for our customers. We are currently re-architecting our systems for better performance and flexibility, providing an ideal chance to create an impact from day one.</span></p>\n\n<p><strong>Team Highlights</strong></p>\n\n<ul>\n<li><span>We receive and process hundreds of billions of records (120TB of data daily) from various sources</span></li>\n<li><span>90K CPUs, 300TB memory, 30PB of Storage</span></li>\n<li><span>Connect and interact with massive scale graph having billions of nodes and trillions of edges</span></li>\n<li><span>Fault tolerant and resilient services at scale</span></li>\n<li><span>Workflow management that involves processing tasks spanning minutes to  days, challenges including failure resilience, sync versus async responses, reloading states, replay &amp; retry, etc.</span></li>\n</ul>\n\n<p><strong>You will:</strong></p>\n\n<ul>\n<li><span>Work collaboratively in a small team of engineers maintaining and improving our File-Based Recognition product.</span></li>\n<li><span>Help craft the future of our technology platform.</span></li>\n<li><span>Infuse industry standard methodologies into our team processes and development practices.</span></li>\n<li><span>Assist in architectural design and implementation of our systems and interfaces.</span></li>\n<li><span>Define infrastructure components using tools like Docker, Kubernetes, and Terraform.</span></li>\n<li><span>Foster a positive environment of integrity, empowerment, initiative, and teamwork.</span></li>\n<li><span>Provide operational support for our team’s production systems.</span></li>\n<li><span>Work with your team and managers to shape your role into a convergence of the company’s needs and your own capabilities, interests, and desires.</span></li>\n</ul>\n\n<p><strong>Your team will:</strong><span> </span></p>\n\n<ul>\n<li><span>Deliver file-based identity resolution solutions to clients - both internal and external.</span></li>\n<li><span>Rearchitect our existing systems to provide a more powerful and flexible data processing environment at scale.</span></li>\n<li><span>Demonstrate operational excellence supporting our production systems.</span></li>\n</ul>\n\n<p><strong>About you:</strong><span> </span></p>\n\n<ul>\n<li><span>8+ years of experience writing and deploying high-quality production code.</span></li>\n<li><span>Proven Java and Scala programming skills.</span></li>\n<li><span>Confirmed ability to build balanced technical solutions that verifiably meet specific, well-defined business requirements.</span></li>\n<li><span>Experience selecting and using industry-standard open source and/or commercial tools and libraries to tackle specific problems.</span></li>\n<li><span>Have made significant and meaningful development contributions to team projects involving distributed systems operating at scale.</span></li>\n<li><span>Experience with GCP or another cloud provider (AWS, Azure, etc.).</span></li>\n<li><span>Deeply inquisitive. Always asking why we do things and how we can do them better.</span></li>\n<li><span>Solid communicator in relevant technical and product concepts.</span></li>\n<li><span>Strive for perfection but settle for excellence.</span></li>\n<li><span>Thrive in a collaborative environment.</span></li>\n</ul>\n\n<p><strong>Bonus Points:</strong></p>\n\n<ul>\n<li><span>Expertise with Apache Spark, Hadoop, Map Reduce</span></li>\n<li><span>Proficiency with Spring Boot.</span></li>\n<li><span>Experience with Uber’s Cadence Platform.</span></li>\n<li><span>Kubernetes wizardry.</span></li>\n</ul>\n\n<p><strong>Benefits:</strong></p>\n\n<ul>\n<li><span>People: Work with talented, collaborative, and friendly people who love what they do.</span></li>\n<li><span>Fun: We host in-person and virtual events such as game nights, happy hours, camping trips, and sports leagues. </span></li>\n<li><span>Work/Life Harmony: Flexible paid time off, paid holidays, options for working from home, and paid parental leave.</span></li>\n<li><span>Whole Health Package: Medical, dental, vision, life, disability, long term care, accident and critical illness insurance, pre-tax accounts (health, dependent and commuter), and a family forming benefit through Carrot. Plus Milk Stork, backup child and elder care, and discount on pet insurance, mental health support (via Talkspace)</span></li>\n<li><span>FlexPerks reimbursement program to provide flexibility and choice ($375/quarter) for fitness, emotional, financial, family, travel and entertainment, convenience and security expenses. (U.S. LiveRampers)</span></li>\n<li><span>Savings: Our 401K matching plan—1:1 match up to 6% of salary—helps you plan ahead.  Also Employee Stock Purchase Plan - 15% discount off purchase price of LiveRamp stock (U.S. LiveRampers)</span></li>\n<li><span>RampRemote: A comprehensive office equipment and ergonomics program—we help you set up your home office (Home-based LiveRampers)</span></li>\n</ul>\n\n<p><strong>About us:</strong></p>\n\n<p><span>LiveRamp is the leading data connectivity platform. We are committed to connecting the world’s data safely and effectively, advancing innovation, and empowering people to do good. Our platform powers customer experiences centered around the needs and concerns of real people, keeping the Internet open for all. We enable individuals around the world to connect with the brands and products they love. LiveRampers thrive on solving challenging problems for the good of humanity—and we’re always looking for smart, kind, and creative people to help us get there.</span></p>\n\n<p><strong>Mission: </strong><span>LiveRamp makes it safe and easy for businesses to use data effectively.</span></p>\n\n<p><span>LiveRamp’s mission is to connect data in ways that matter, and doing so starts with our people. We know that inspired teams enlist people from a blend of backgrounds and experiences. And we know that individuals do their best when they not only bring their full selves to work but feel like they truly belong. Connecting LiveRampers to new ideas and one another is one of our guiding principles—one that informs how we hire, train, and grow our global team across eight countries and four continents.</span></p>\n\n<h6><span>LiveRamp is an affirmative action and equal opportunity employer (AA/EOE/W/M/Vet/Disabled) and does not discriminate in recruiting, hiring, training, promotion or other employment of associates or the awarding of subcontracts because of a person's race, color, sex, age, religion, national origin, protected veteran, disability, sexual orientation, gender identity, genetics or other protected status. Qualified applicants with arrest and conviction records will be considered for the position in accordance with the San Francisco Fair Chance Ordinance. </span></h6>\n\n<h6><span>California residents: Please see our </span><a href=\"https://liveramp.com/privacy/california-personnel-privacy-policy/\"><span>California Personnel Privacy Policy</span></a><span> for more information regarding how we collect, use, and disclose the personal information you provide during the job application process.</span></h6>\n\n<p><em><span>To all recruitment agencies: LiveRamp does not accept agency resumes. Please do not forward resumes to our jobs alias, LiveRamp employees or any other company location. LiveRamp is not responsible for any fees related to unsolicited resumes.</span></em></p>\n\n<p><em><span>#LR-Remote</span></em></p>",
			"name": "Staff Software Engineer, FBR",
			"type": "external",
			"publication_date": "2021-12-14T23:14:52Z",
			"short_name": "staff-software-engineer-fbr",
			"model_type": "jobs",
			"id": 4368977,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/liveramp/staff-software-engineer-fbr"
			},
			"company": {
				"id": 12120,
				"short_name": "liveramp",
				"name": "LiveRamp"
			}
		},
		{
			"contents": "<p><b>Date Posted:</b><br>2021-10-25-07:00<br><b>Country:</b><br>United States of America<br><b>Location:</b><br>01: Building 01 Windsor Locks One Hamilton Road, Windsor Locks, CT, 06096 USA<br> This position is for a seasoned Chemical and Materials Engineering professional working independently.  Designs surface engineering solutions, develops processes and common procedures, conducts tests on raw materials, and may support production, including performing failure analysis. <br><br><b> This individual will work in a Hybrid Model out of the Windsor Locks, CT location. </b><br><br><b> Primary Responsibilities: </b><br><ul><li>Conducts research to develop new and improved surface engineering processes, such as for corrosion protection, wear resistance, etc..</li><li>Develops process standards using controlled chemical processes.</li><li>Conducts or supervises tests on materials or finished products to ensure their quality, and works to remedy issues both internally and with our customers if specification not followed correctly.</li><li>Designs and directs the testing for new surface engineering processes, including material analysis and optimization.</li><li>Works cooperatively in a multidiscipline team to ensure best design as well as collecting data for computation and model-based approaches.</li><li>Provides technical leadership and assists in training less experienced engineers, when required, to help them diagnose and solve problems and enhance their capabilities.</li><li>Creates and implements common procedures and standard work across the organization to optimize efficiency and quality.</li><li>Analyzes, researches, designs and develops materials and their related fabrication and application processes to develop and optimize materials for use in engineering design of and/or application in structures, systems and subsystems.</li><li>Performs material analyses that include, but are not limited to, failure analysis of components, systems and subsystems, life predictions, and definition and requirement specifications.</li><li>Applies principles of chemistry, physics, and material behavior to develop metallic, non-metallic and composite material and processing specifications, fabrication and assembly processes.</li><li>May review and approve subcontractor material processing procedures.</li></ul><br><br><b> Basic Qualifications: </b><br><ul><li>Bachelor's degree and 5 years of prior relevant experience OR</li><li>Advanced Degree in a related field and minimum 3 years' experience OR</li><li>In absence of a degree, 9 years of relevant experience is required</li><li>Engineering/Other Technical Positions: Bachelor's degree (typically in Science, Technology, Engineering or Mathematics (STEM)) and a minimum of 5 years of prior relevant experience unless prohibited by local laws/regulations</li><li>Must be a U.S. Person/Permanent Resident \"Green Card\" holder</li><li>Must be willing and able to travel 15% of the time</li><li>2+ years' experience with corrosion mitigation</li></ul><br><br><b>Preferred Qualifications:</b><br><ul><li>Prior experience in manufacturing</li><li>2+ years' experience with vapor deposition, plating, and/or coating wear experience</li><li>Experience with improving the surface finish of metals &amp; composites</li><li>Experience with coating formulation development</li><li>Experience with modeling and/or analytical characterization</li></ul><br><br>Collins Aerospace, a Raytheon Technologies company, is a leader in technologically advanced and intelligent solutions for the global aerospace and defense industry. Collins Aerospace has the capabilities, comprehensive portfolio, and expertise to solve customers' toughest challenges and to meet the demands of a rapidly evolving global market.<br><br>Collins Aerospace makes modern flight possible. Of course, that wouldn't be possible without the capabilities and technologies of our organization, as well as our engineers - a highly skilled, accomplished network that spans more than 180 sites, 24 countries and 6 Strategic Business Units (SBUs).<br><br>Our industry-leading experts are setting the standards for the aerospace industry and paving the way for the future. But as new challenges present themselves, we need fresh, creative, and motivated minds to overcome these hurdles, help us break barriers and achieve new levels of innovation. Do you have what it takes to join a global, diverse organization that doesn't shy away from big opportunities? If so, we invite you to join our ranks and create the next generation of aerospace technologies.<br><br>Together, we will nurture an engineering culture that values intellectual curiosity, risk takers and integrity. A place where we will challenge ourselves, our teams, and the status quo and where we will work to find a way - the right way - to achieve what others can only dream of.<br><br><b>Collins Aerospace Diversity &amp; Inclusion Statement:</b><br><br><b>Diversity drives innovation; inclusion drives success</b>. We believe a multitude of approaches and ideas enable us to deliver the best results for our workforce, workplace, and customers. We are committed to fostering a culture where all employees can share their passions and ideas so we can tackle the toughest challenges in our industry and pave new paths to limitless possibility.<br><br><b>WE ARE REDEFINING AEROSPACE.</b><br><br>Some of our competitive benefits package includes: <br><ul><li>Medical, dental, and vision insurance</li><li>Three weeks of vacation for newly hired employees</li><li>Generous 401(k) plan that includes employer matching funds and separate employer retirement contribution, including a Lifetime Income Strategy option</li><li>Tuition reimbursement</li><li>Life insurance and disability coverage</li><li>Optional coverages you can buy: Pet Insurance, Home and Auto, additional life insurance, accident insurance, critical illness insurance, group legal</li><li>Ovia Health, fertility, and family planning</li><li>Employee Assistance Plan, including up to 5 free counseling sessions</li><li>Redbrick - Incentives for a Healthy You</li><li>Autism Benefit</li><li>Doctor on Demand, virtual doctor visits</li><li>Adoption Assistance</li><li>Best Doctors, second opinion program</li><li>And more!</li></ul><br><br>Nothing matters more to Collins Aerospace than our strong ethical and safety commitments. As such, all U.S. positions require a background check, which may include a drug screen.<br><br>Note:<br><ul><li>Background check and drug screen required (every external new hire in the U.S.)</li><li>Drug Screen only performed on re-hires who have been gone for more than 1 year</li></ul><br><br>At Collins, the paths we pave together lead to limitless possibility. And the bonds we form - with our customers and with each other -- propel us all higher, again and again. <br><br>Apply now and be part of the team that's redefining aerospace, every day. <br><br> <b> Raytheon Technologies is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class. </b> <br><br><b>Privacy Policy and Terms:</b><br><br> Click on this link to read the Policy and Terms</p>",
			"name": "Senior Surface Engineer, Research & Development",
			"type": "external",
			"publication_date": "2021-10-29T11:11:13Z",
			"short_name": "senior-surface-engineer-research-development",
			"model_type": "jobs",
			"id": 7240322,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/collinsaerospace/senior-surface-engineer-research-development"
			},
			"company": {
				"id": 12052,
				"short_name": "collinsaerospace",
				"name": "Collins Aerospace"
			}
		},
		{
			"contents": "<p><strong>Senior Full Stack Engineer (Python/React)</strong></p>\n\n<p><span>LiveRamp is the leading data connectivity platform. We believe connected data has the power to change the world. Our platform powers insights and experiences centered around the needs of real people, and in ways that keep the Internet open for all. LiveRampers thrive on building together with curiosity and humility—and have a good bit of fun along the way. We’re always looking for smart, kind, and creative people to grow our team and impact.</span></p>\n\n<p><strong>Mission: </strong><span>LiveRamp makes </span><span>it safe and easy for businesses to use data effectively.</span></p>\n\n<p><em><span>The Measurement team wrangles petabytes of data and leverages advanced data science techniques to help LiveRamp’s customers quantify the efficacy and ROI of their ad campaigns. The team employs best of breed distributed computing technologies to generate advanced analytics results that can be distributed through a variety of business intelligence tools.</span></em></p>\n\n<p><strong>You will:</strong></p>\n\n<ul>\n<li><span>Collaborate with our engineering and customer operations teams to create tools and full stack applications that scale their work.</span></li>\n<li><span>Design, create and maintain RESTful API interfaces to petabyte-scale backends.</span></li>\n<li><span>Write automation tools for all aspects of development (Python and Scala): infrastructure orchestration and configuration, code build and release pipelines, data pipeline testing frameworks.  </span></li>\n<li><span>Gain experience working in multiple cloud environments such as AWS and GCP.</span></li>\n<li><span>Treat infrastructure as code leveraging tools like Terraform, Docker and Kubernetes.</span></li>\n<li><span>Help design new product offerings in the Measurement space.</span></li>\n</ul>\n\n<p><strong>Your team will:</strong><span> </span></p>\n\n<ul>\n<li><span>Support Measurement Customer Facing Applications through analytics engine and tooling data exports and / or UIs</span></li>\n<li><span>Support Measurement Operations through Ops Tooling applications that help administer the Measurement Platform</span></li>\n<li><span>Support common Measurement AWS Tools and Frameworks (CI/CD, testing, deploys, etc) Tools req? </span></li>\n</ul>\n\n<p><strong>About you:</strong><span> </span></p>\n\n<ul>\n<li><span>5+ years experience in full stack application development.</span></li>\n<li><span>Strong ability to break down complex problems to their essential components and design and implement elegant solutions for them.</span></li>\n<li><span>Experience designing, building and deploying both RESTful APIs and full stack MVC applications.</span></li>\n<li><span>Strong understanding of various code testing frameworks and tools.</span></li>\n<li><span>Curious to learn and comfortable evaluating and adapting to the latest tools and industry best practices.</span></li>\n<li><span>Significant experience in Python or JavaScript.</span></li>\n<li><span>Strong SQL knowledge and experience working with relational databases.</span></li>\n<li><span>Have a startup personality and enjoy working as part of a Scrum team: smart, ethical, friendly, hard-working, and productive.</span></li>\n<li><span>Strong oral and written communication, project management and organizational skills.</span></li>\n</ul>\n\n<p><strong>Bonus Points:</strong></p>\n\n<ul>\n<li><strong>Experience with Django, Flask or Node frameworks.</strong></li>\n<li><strong>Experience with OpenAPI and Swagger.</strong></li>\n<li><strong>Experience with writing complex Jenkins pipelines.</strong></li>\n<li><span>Experience with Docker and Kubernetes.</span></li>\n<li><span>Some experience with React or Angular or not afraid to roll up your sleeves and dabble in them.</span></li>\n</ul>\n\n<p><strong>Benefits:</strong></p>\n\n<ul>\n<li><span>People: Work with talented, collaborative, and friendly people who love what they do.</span></li>\n<li><span>Fun: We host in-person and virtual events such as game nights, happy hours, camping trips, and sports leagues. </span></li>\n<li><span>Work/Life Harmony: Flexible paid time off, paid holidays, options for working from home, and paid parental leave.</span></li>\n<li><span>Whole Health Package: Medical, dental, vision, life, disability, long term care, accident and critical illness insurance, pre-tax accounts (health, dependent and commuter), and a family forming benefit through Carrot. Plus Milk Stork, backup child and elder care, and discount on pet insurance, mental health support (via Talkspace)</span></li>\n<li><span>FlexPerks reimbursement program to provide flexibility and choice ($375/quarter) for fitness, emotional, financial, family, travel and entertainment, convenience and security expenses. (U.S. LiveRampers)</span></li>\n<li><span>Savings: Our 401K matching plan—1:1 match up to 6% of salary—helps you plan ahead.  Also Employee Stock Purchase Plan - 15% discount off purchase price of LiveRamp stock (U.S. LiveRampers)</span></li>\n<li><span>RampRemote:</span> <span>A comprehensive office equipment and ergonomics program—we prove you with equipment and tools to be your most productive self, no matter where you're located.</span></li>\n<li><span>Location: work in the heart of </span><span>San Francisco and/or from home (remote-eligible roles)</span></li>\n</ul>\n\n<p><strong>More about us:</strong></p>\n\n<p><span>LiveRamp’s mission is to connect data in ways that matter, and doing so starts with our people. We know that inspired teams enlist people from a blend of backgrounds and experiences. And we know that individuals do their best when they not only bring their full selves to work but feel like they truly belong. Connecting LiveRampers to new ideas and one another is one of our guiding principles—one that informs how we hire, train, and grow our global team across nine countries and four continents. </span><a href=\"https://liveramp.com/about/diversity-inclusion-belonging/\"><span>Click here</span></a><span> to learn more about Diversity, Inclusion, &amp; Belonging (DIB) at LiveRamp.</span></p>\n\n<h6><span>LiveRamp is an affirmative action and equal opportunity employer (AA/EOE/W/M/Vet/Disabled) and does not discriminate in recruiting, hiring, training, promotion or other employment of associates or the awarding of subcontracts because of a person's race, color, sex, age, religion, national origin, protected veteran, disability, sexual orientation, gender identity, genetics or other protected status. Qualified applicants with arrest and conviction records will be considered for the position in accordance with the San Francisco Fair Chance Ordinance. </span></h6>\n\n<h6><span>California residents: Please see our </span><a href=\"https://liveramp.com/privacy/california-personnel-privacy-policy/\"><span>California Personnel Privacy Policy</span></a><span> for more information regarding how we collect, use, and disclose the personal information you provide during the job application process.</span></h6>\n\n<p><em><span>To all recruitment agencies: LiveRamp does not accept agency resumes. Please do not forward resumes to our jobs alias, LiveRamp employees or any other company location. LiveRamp is not responsible for any fees related to unsolicited resumes.</span></em></p>\n\n<p><em><span>#LI-Remote </span></em></p>",
			"name": "Senior Full Stack Engineer (Python/React)",
			"type": "external",
			"publication_date": "2022-01-08T11:08:28Z",
			"short_name": "senior-full-stack-engineer-pythonreact-24e7f4",
			"model_type": "jobs",
			"id": 7796455,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/liveramp/senior-full-stack-engineer-pythonreact-24e7f4"
			},
			"company": {
				"id": 12120,
				"short_name": "liveramp",
				"name": "LiveRamp"
			}
		},
		{
			"contents": "<p>The Director of Technology Reliability will lead an organization of reliability engineering teams dedicated to identifying and mitigating risk through high fidelity signals and assessments. The Director of Technology Reliability will partner will various cross-functional teams to bring the right product to market by ensuring risks are properly identified, triaged, and mitigated appropriately through the development cycle.<ul><li>Lead multiple teams of reliability engineers to support development of our hardware technology portfolio</li><li>including but not limited to optical, display, camera, sensor, battery, silicon, and material technologies</li><li>Collaborate with cross-functional HW, Product, PMO, and OPS functions through all phases of the Product Development Process (PDP) to ensure risk is properly identified and addressed</li><li>Drive reliability excellence by ensuring proper standardization and innovation of reliability assessments for all products, updated use cases, innovation, and mission profiles</li><li>Provide technical guidance and direction on all aspects of reliability risk escalation</li><li>Comprehensive understanding on reliability modeling, physics of failure, and risk assessment methodology</li><li>Experience partnering with global leaders, HR and recruiting to develop and execute on a strategy to attract, retain, and develop top talent and role model leadership best practices</li><li>Champion and foster a culture of diversity, equity, and inclusion</li></ul><ul><li>Track record, and demonstrated leadership, in developing innovative consumer hardware technologies into successful mass-market consumer products</li><li>Experience simultaneously managing multiple technologies and multiple projects within each technology</li><li>10+ years people management experience including managing managers and managing remotely across regions</li><li>Experience in strategic leadership, proactively identifying opportunities for innovation, investment, partnership, and continuous growth with respect to organizational health and impact</li><li>10+ years of Reliability Engineering experience</li><li>Collaboration and relationship-building experience, working with all levels of management and individual contributors, internally and externally</li><li>MS in Materials Engineering, Electrical Engineering, Mechanical Engineering, Chemical Engineering, Reliability Engineering, or equivalent combination of education and experience</li></ul><ul><li>PhD in Materials Engineering, Electrical Engineering, Mechanical Engineering, Chemical Engineering, Reliability Engineering, or equivalent combination of education and experience</li></ul>Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started. <br><br>Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.</p>",
			"name": "Director, Technology Reliability Engineering",
			"type": "external",
			"publication_date": "2022-01-29T23:09:27Z",
			"short_name": "director-technology-reliability-engineering-adc576",
			"model_type": "jobs",
			"id": 7981830,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [
				{
					"name": "Fortune 1000",
					"short_name": "fortune-1000-companies"
				}
			],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/meta/director-technology-reliability-engineering-adc576"
			},
			"company": {
				"id": 659,
				"short_name": "meta",
				"name": "Meta"
			}
		},
		{
			"contents": "<p><b>DESCRIPTION</b><br><br> Job summary<br>Ever wondered how Amazon is using its Global presence to offer best of Amazon experience to its international customers? Amazon Global store allows customers to buy imported products in their local current and experience. This is Amazon first cross marketplace initiative that allows selection from one marketplace to list on another marketplace. Given our rapid growth and this huge opportunity we are applying cutting edge technology to solve complex business problems. Do you like working on projects that are highly visible and are tied closely to Amazon's profitability and growth? Are you seeking an environment where you can drive innovation leveraging the scalability and innovation with Amazon's AWS cloud services? Do you want to pave the future for Amazon Retail, enhancing how we do business globally? If so, Amazon Global Store is seeking a Software Development Engineer who wants to stretch both their technical abilities and their business know-how to implement creative global solutions and act as a leader of leaders.<br><br>Our mission is to provide a one-stop shopping experience to international customers that includes:<br>•  Build solutions that reach millions of new customers all over the world, providing them with a world class shopping experience in their local language, payments, and currencies<br>•  Drive customer experience technology for supporting customers all over the world<br>•  Work closely with the business to define the expansion strategy and figure out innovative solutions to help this thriving business continue to its exponential growth<br>We enable customers from over 77 countries to purchase products on Amazon with guaranteed shipping and import duty fees. We seek to improve this experience by making selection available across all Amazon marketplaces, so that customers can search and browse in their preferred language and currency.<br><br>By submitting your application here, you can apply once to be considered for multiple Software Engineer openings across various Amazon teams. If you are successful in passing through the initial application review and assessment, you will be asked to submit your career and personal preferences so that our dedicated recruiters can match you to the right role based on these preferences.<br><br>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us<br><br> <b>BASIC QUALIFICATIONS</b> <br><br> •  1+ years of experience contributing to the system design or architecture (architecture, design patterns, reliability and scaling) of new and current systems.<br>•  2+ years of non-internship professional software development experience<br>•  Programming experience with at least one software programming language.<br><br> <b>PREFERRED QUALIFICATIONS </b> <br><br> •  Bachelor's Degree in Computer Science or related field<br>•  Equivalent experience to a Bachelor's degree based on 3 years of work experience for every 1 year of education<br>•  Experience taking a leading role in building complex software systems that have been successfully delivered to customers<br>•  Experience with distributed computing and enterprise-wide systems<br>•  Experience in communicating with users, other technical teams, and senior management to collect requirements, describe software product features, technical designs, and product strategy<br>•  Experience mentoring junior software engineers to improve their skills, and make them more effective, product software engineers<br>•  Experience influencing software engineers best practices within your team<br>•  Hands-on expertise in many disparate technologies, typically ranging from front-end user interfaces through to back-end systems and all points in between<br><br>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.</p>",
			"name": "Software Development Engineer, Global Store Shopping",
			"type": "external",
			"publication_date": "2022-01-15T12:34:32Z",
			"short_name": "software-development-engineer-global-store-shopping-ee6c44",
			"model_type": "jobs",
			"id": 7874206,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Mid Level",
					"short_name": "mid"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/amazon/software-development-engineer-global-store-shopping-ee6c44"
			},
			"company": {
				"id": 12090,
				"short_name": "amazon",
				"name": "Amazon"
			}
		},
		{
			"contents": "<p>At BetterUp, we give people the coaching, support, and push they need to reach peak performance and unlock their limitless potential, in all they do, personally and professionally. We work with world-class experts and Coaches, pioneer innovative technology, and foster human touch at scale to fuel the BetterUp experience, and make growth and development achievable for all. We believe that practicing strong mental fitness is a never-ending practice of maintaining and building the strengths that precede health, happiness, and success. </p>\n\n<p>And we’re looking to build out a diverse and ambitious team of go-getters to join us as we grow. Exciting opportunities lie ahead, as well as work that makes a real difference — not only in the lives of others, but for your own personal and professional growth, too. Join us as we continue to bring BetterUp to more people everywhere, and create impactful change for our members and for you. </p>\n\n<p><span>We’re looking for an engineering leader who thrives on building world class teams to affect positive change in the world. At BetterUp we understand that true innovation comes from empowering groups of talented people to move fast and think creatively. Our managers exist to serve this end by supporting, unblocking, and pushing their teams to produce their best possible work. This could mean many different things from day to day but it does not involve simply handing out tasks to engineers for them to build. We’re seeking a leader who finds fulfillment in truly unlocking the potential of others.</span></p>\n\n<p><strong>What you'll do: </strong><strong><br></strong></p>\n\n<ul>\n<li><strong>Team Leader </strong><span>-</span> <span>Lead agile software processes and help refine the product and engineering roadmap to drive user value and business impact. Contextualize new information for the team and provide updates to organizational leaders. Exercise sound judgement in helping guide team direction.</span></li>\n<li><strong>Player + Coach </strong><span>- Get to know your team to understand their strengths, passions, and challenges. Know when to push people to help them realize their potential and how to support them when they struggle. Foster alignment between the goals of the individual and the needs of the business wherever possible. Learn the technical architecture and contribute by building features and reviewing code.</span></li>\n<li><strong>Talent Seeker </strong><span>-</span> <span>Recruit, hire, and maintain a diverse team of exceptional remote first engineers. Hold a high bar of excellence for your team and encourage them to hold each other accountable.</span></li>\n<li><strong>Agent of Change </strong>- Optimize and evolve engineering culture, processes, and best practices to create an environment where engineers are elevated by the ecosystem rather than hindered by it.</li>\n</ul>\n\n<p><strong>If you have some or all of the following, please apply: </strong></p>\n\n<ul>\n<li><span>Passion for coaching, education, behavioral sciences or other fields that lead to human well-being</span></li>\n<li><span>10 years minimum software development experience (some of which involves leading teams)</span></li>\n<li><span>Proven leadership skills and strong oral and written communication</span></li>\n<li><span>Experience with startups and remote-first teams</span></li>\n<li><span>Expertise in agile software development processes (Kanban/SCRUM/Lean principles)</span></li>\n<li><span>Intentional prioritization and ability to deliver maximum impact with minimal effort</span></li>\n<li><span>Familiar with Continuous Deployment operations (Continuous Integration, Continuous Deployment, and Feature Toggles)</span></li>\n<li><span>Deep understanding of SaaS/PaaS cloud architectures (AWS)</span></li>\n<li><span>Experience with multiple programming languages, standards, and best practices (Ruby/Javascript/Swift/Kotlin)</span></li>\n<li><span>Self-directed and comfortable working in ambiguous environments</span></li>\n</ul>\n\n<p><strong>Benefits:</strong></p>\n\n<p>At BetterUp, we are committed to living out our mission every day and that starts with providing benefits that allow our employees to care for themselves, support their families, and give back to their community. </p>\n\n<ul>\n<li>Access to BetterUp coaching; one for you and one for a friend or family member </li>\n<li>A competitive compensation plan with opportunity for advancement</li>\n<li>Medical, dental and vision insurance</li>\n<li>Flexible paid time off</li>\n<li>Per year: </li>\n<ul>\n<li>All federal/statutory holidays observed</li>\n<li>4 BetterUp Inner Work days (<a href=\"https://www.betterup.co/inner-work\">https://www.betterup.co/inner-work</a>)</li>\n<li>5 Volunteer Days to give back</li>\n<li>Learning and Development stipend</li>\n</ul>\n<li>Year-round charitable contribution of your choice on behalf of BetterUp</li>\n<li>401(k) self contribution</li>\n</ul>\n\n<p>We are dedicated to building diverse teams that fuel an authentic workplace and sense of belonging for each and every employee. We know applying for a job can be intimidating, please don’t hesitate to reach out — we encourage everyone interested in joining us to apply.<br><br>BetterUp Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, disability, genetics, gender, sexual orientation, age, marital status, veteran status. In addition to federal law requirements, BetterUp Inc. complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training. </p>\n\n<p><span>#LI-Remote</span></p>",
			"name": "Engineering Manager",
			"type": "external",
			"publication_date": "2021-12-30T23:06:37Z",
			"short_name": "engineering-manager",
			"model_type": "jobs",
			"id": 4527182,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/betterup/engineering-manager"
			},
			"company": {
				"id": 12031,
				"short_name": "betterup",
				"name": "BetterUp"
			}
		},
		{
			"contents": "<p><b>DESCRIPTION</b><br><br> Are you interested in taking the world's most broadly adopted and comprehensive cloud platform and architecting and building solutions that will deliver consumer and retail like customer excellence to the recruiting and hiring process at AWS?<br><br>About the team<br>The AWS Talent Acquisition Product Development team is responsible for innovating, architecting, and building, global and scalable technology solutions that transform the recruiting and hiring experience. These solutions will be utilized by thousands of people inside and outside the organization. This team and the solutions we build are a critical component in AWS's continued growth.<br><br>A day in the life<br>Innovation is at the center of this team. As a Software Engineer on the AWS Talent Acquisition Product Development Team you will have an opportunity to collaborate with a team of customers, designers, product managers, data scientists, and data engineers in building chat and voice based solutions that deliver talent intelligence insights at scale to a broad range of global business users and leaders. This team will shape the strategic direction and inform talent decisions at the highest levels of AWS, helping us to become the world's most scientific and technically proficient Talent Acquisition organization.<br><br> <b>BASIC QUALIFICATIONS</b> <br><br> •  Bachelor's degree in Computer Science, Software Engineering or a related technical discipline.<br>•  1-2 years full time experience in software design and development.<br>•  Proficiency with at least one Object Oriented language (e.g. Java, Python).<br>•  Computer Science fundamentals in object-oriented design, data structures, algorithm design, problem solving, and complexity analysis.<br>•  A strong track record of project delivery for large, cross-functional projects.<br>•  Experience building complex software systems that have been successfully delivered to customers.<br>•  Experience with building high-performance, highly-available and scalable distributed systems.<br>•  A willingness to dive deep, experiment rapidly, and get things done.<br><br> <b>PREFERRED QUALIFICATIONS </b> <br><br> •  Deep knowledge of Distributed SOA Architecture, Relational DB Knowledge, Elastisearch, DynamoDB, and various AWS Technologies.<br>•  High attention to detail and proven ability to manage multiple, competing priorities simultaneously.<br>•  Ability to work in a fast-paced environment where continuous innovation is desired.<br>•  History of teamwork and willingness to roll up one's sleeves to get the job done.<br>•  Experience with other front end development skills is a plus.</p>",
			"name": "Software Development Engineer",
			"type": "external",
			"publication_date": "2021-10-14T23:38:35Z",
			"short_name": "software-development-engineer-173ae1",
			"model_type": "jobs",
			"id": 7125488,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Mid Level",
					"short_name": "mid"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/amazon/software-development-engineer-173ae1"
			},
			"company": {
				"id": 12090,
				"short_name": "amazon",
				"name": "Amazon"
			}
		},
		{
			"contents": "<p><b>Job Title</b><br>Senior Software Support Engineer - Healthcare Systems<br><br><b>Job Description</b><br><br>If you are a Colorado resident and this role is a field-based or remote role, you may be eligible to receive additional information about the compensation and benefits for this role, which we will provide upon request.  You may c ontact 888-367-7223, option 5, for assistance.<br><br>Philips is a global leader in health technology, committed to improving billions of lives worldwide and striving to make the world healthier and more sustainable through innovation. Driven by the vision of a better tomorrow.<br><br>But it's not just what we do, it's who we are. We are 80,000, wonderfully unique individuals, with two things in common: An unwavering sense of purpose and a relentless determination to deliver on our customers' needs. It's what inspires us to create meaningful solutions - the kind that make a real difference - when it matters most.<br><br>The world and our customers' needs are changing faster than ever before and while we are proud of what we do already, we know we can do more. That's why we need you, to help us tackle increasingly complex challenges posed by ever evolving health and well-being needs.<br><br><b> In this role, you have the opportunity to make life better </b><br><br>Looking at the challenges the world is facing today Philips' purpose has never been more relevant. So, whatever your role, if you share our passion for helping others, you'll be working towards creating a better and fairer future for all.<br><br>The Technical Engineer at Interoperability Solutions will provide technical advice to our existing partners/customers.<br><br>In this role, you have the opportunity to provide technical advice and integration support to existing customers and perform the installation and configuration of our complex software . You will also provide support and consultancy after go-live.<br><br>The role will be a mix of consultancy, training, support, installation &amp; configuration, integration with other systems, troubleshooting. The activities are mainly focused around our software and the OS and Virtual Machine environments the systems runs on.<br><br><b> You are responsible for </b><ul><li>Providing expertise and support for (pilot) installations, configurations and integrations, both remote and on-site. This includes custom scripting and forms design for customers;</li><li>Training of customers (end-users and system admins)</li><li>Solving problems and providing in-depth support via remote support and dial-in;</li><li>Supporting our support department by answering questions of customers regarding installation, configuration and product functionality;</li><li>Providing project management support to the primary project manager of the customer for the IS activities in such a project</li><li> This role is remotely and customer facing when there is a need, e.g. while doing on-site support; </li><li>Providing consultancy for extending the use-cases and other new possibilities of the system within the customers setting</li><li>You are a part of the support team in Zeist and will have a close alignment with our team in Toronto.</li><li>Managing environments (OS + software). Ex: upgrading Forcare software / 3rd party products / OS + security patches, running reports, executing proactive support + monitoring of critical systems, updating licenses.</li></ul><b> To succeed in this role, you'll need a customer-first attitude and the following</b><ul><li>Bachelor's degree</li><li>3+ years of experience in a similar position</li><li>Experience with supporting software products within the healthcare market;</li><li>Operating systems (Windows Server / Linux);</li><li>Database management techniques;</li><li>Knowledge of HTML/XML/SOAP/SQL queries</li><li>Experienced in one or more script languages</li><li>Infrastructure and Network troubleshooting</li><li>Healthcare communication standards (DICOM, HL7, IHE) required</li><li>Preferred: Apache Tomcat (installation, configuration, maintenance)</li><li>Strong analytical skills and a real problem solver;</li><li> A hands one mentality, pro-active and independent in your work </li><li>\"Get things done\" mentality</li><li>Interpersonal abilities (Can relate well to others, both colleagues and customers)</li><li>Effective communicator in English (both oral and written)</li><li>Flexible in working hours, travel and work environments</li></ul><b> In return, we offer you </b><br><br>The ability to collaborate with, learn and grow from colleagues in a highly complex, global organization where you can use your strengths to help drive strategic business initiatives for Philips.  Additionally, we provide you a dynamic working environment in an innovative business, paired with a competitive salary, excellent benefits, and a supportive atmosphere where you can sharpen your talents with new challenges and career opportunities.<br><br>US work authorization is a precondition of employment. The company will not consider candidates who require sponsorship for a work-authorized visa.<br><br><b>How we work at Philips</b><br><br>There are three core ways that define our ways of working - embracing flexibility, being at our best, and impactful collaboration . We believe this enables us to deliver an outstanding experience to our customers and create the best place to work for people who share our passion.<br><br>We know just how important direct interactions are and work is more engaging when we are more frequently face-to-face, and that we experience better collaboration which drives innovation. While we have many different types of roles across Philips most require a combination of in-person collaboration with colleagues and partners, usually at a Philips location, and individual focus time, which can be done remotely.<br><br><b>Why should you join Philips?</b><br><br>Working at Philips is more than a job. It's a calling to create a healthier society through meaningful work, focused on innovative, customer-first health technology solutions. Help us improve the health and well-being of billions of people, every year. Ultimately creating a career that no one could have planned for. Even you.<br><br>Visit our careers website to explore what it's like working at Philips , read stories from our employee blog , find information about our recruitment process and answers to some frequently asked questions .<br><br>It is the policy of Philips to provide equal employment and advancement opportunities to all colleagues and applicants for employment without regard to race, color, ethnicity, religion, gender, pregnancy/childbirth, age, national origin, sexual orientation, gender identity or expression, disability or perceived disability, genetic information, citizenship, veteran or military status or a person's relationship or association with a protected veteran, including spouses and other family members, marital or domestic partner status, or any other category protected by federal, state and/or local laws.<br><br>As an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.<br><br>Equal Employment and Opportunity Employer/Disabled/Veteran<br><br>#LI-PH1 <br><br> #LI-Remote<br><br><b>Contact</b><br><br><b> If you forgot your password, you can click the  Forgot Password  button on the Sign In screen to reset it. </b></p>",
			"name": "Senior Software Support Engineer - Healthcare Systems",
			"type": "external",
			"publication_date": "2021-12-08T11:37:53Z",
			"short_name": "senior-software-support-engineer-healthcare-systems",
			"model_type": "jobs",
			"id": 7284418,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/philips/senior-software-support-engineer-healthcare-systems"
			},
			"company": {
				"id": 1103,
				"short_name": "philips",
				"name": "Philips"
			}
		},
		{
			"contents": "<p>The world isn't standing still, and neither is Allstate. We're moving quickly, looking across our businesses and brands and taking bold steps to better serve customers' evolving needs. That's why now is an exciting time to join our team. You'll have opportunities to take risks, challenge the status quo and shape the future for the greater good.<br><br>You'll do all this in an environment of excellence and the highest ethical standards - a place where values such as integrity, inclusive diversity and accountability are paramount. We empower every employee to lead, drive change and give back where they work and live. Our people are our greatest strength, and we work as one team in service of our customers and communities. Plus, Allstate is changing how, when, and where we work-to lead us boldly into our future. We're empowering our employees to create better ways of working through more intentional use of communication and collaboration practices, processes and tools.<br><br>Everything we do at Allstate is driven by a shared purpose: to protect people from life's uncertainties so they can realize their hopes and dreams. For more than 89 years we've thrived by staying a step ahead of whatever's coming next - to give customers peace of mind no matter what changes they face. We acted with conviction to advocate for seat belts, air bags and graduated driving laws. We help give survivors of domestic violence a voice through financial empowerment. We've been an industry leader in pricing sophistication, telematics, digital photo claims and, more recently, device and identity protection. We are the Good Hands. We don't follow the trends. We set them.<br><br>Job Summary <br><br>Think that working in the insurance field can't be exciting, rewarding and challenging? Think again! <br>Allstate is looking for a <strong>Java Software Engineer </strong>to join our Discoverable Data Domain team in support of the Allstate Family of Companies.<br><br>Allstate is expanding beyond insurance to offer our customers a complete circle of protection for all aspects of their lives. The Allstate Family of Companies, formed through acquisition and new business startup, includes brands like Allstate Roadside Services, InfoArmor, SquareTrade, Esurance, Allstate Benefits, Allstate Dealer Services, and Drift Car Sharing.<br><br>About You <br><br>• You are passionate about software engineering<br>• You measure success by delivering working software and end user satisfaction<br>• You have a desire to reimagine our business for the customer's benefit<br>• You are comfortable with ambiguity, and even use it to drive better ideas, work and success<br><br>What You Will Do <br><br>In this role, you will serve as a member of the Discoverable Data Domain team. You will practice and be the champion of Agile delivery utilizing Continuous Integration &amp; Deployment practices. You will be developing and implementing Java-based Restful backend services and will leverage test driven development and continuous integration to ensure agility and quality of products.<br><br>You will actively participate in the decision-making process of the team ensuring that the simplest appropriate technology and design is chosen to meet user needs, coach other team members, creating an environment of continuous learning, and constantly challenging and stretching the knowledge of the team.<br><br><b>Job Duties</b><br><br>Participates in iteration planning meetings ensuring that the team has a common understanding of each story and chores in a team's backlog<br>Leads and participates in daily site, cross-site, and product team standups<br>Participates in retrospectives to gather feedback and derive actionable items to improve the team and the product<br>Participates in executing the strategy, keeping the customer needs and wants in mind<br>Serves as an expert on a specific business domain and demonstrates leadership and accountability on at least one technology stack<br>Provides input into the architecture and design of the product; collaborating with the team in solving problems the right way<br>Practices daily paired programming and test-driven development in writing software and building product<br>Coaches more junior team members around different technologies and agile practices<br>Participates in knowledge sharing, and contributes to the overall growth of the collective knowledge of the team.<br><br>Experience <br><br><strong>Education</strong><br><br>A college degree or equivalent experience in Computer Science or similar field, including a solid understanding of Computer Science fundamentals<br><br><strong>Overall</strong><ul><li><strong>3+ years of developing and implementing software systems at scale </strong></li><li>Experience and knowledge in developing/consuming <strong>Java (version 8 and onwards) based REST APIs</strong> including tooling for documentation (swagger, REST-docs, openapi spec, Postman), versioning, service discovery/registration, testing and management, with recent experience in Spring Boot is required</li><li>Recent experience working in a SAFe agile environment</li><li>Strong verbal communication and collaboration skills</li><li>Experience designing applications iteratively - you will not receive a full spec upfront and will need to feel comfortable thinking things through, filling in the blanks, and iterating across sprints as we receive feedback and pivot based on customer feedback</li><li>Experience developing software in different programming languages, and demonstrated ability to quickly learn new languages</li><li>Able to learn new technologies, and teach other members of the team</li><li>Strong understanding of distributed systems, operating systems, networking, databases, security, and analytics</li><li>Clear understanding of cloud services, deployment models, and distributed systems</li></ul><strong>Technical</strong><ul><li><strong>Experience in Test Driven Development; including knowledge and experience in testing frameworks (such as junit, mockito, jasmine, protractor, cucumber, and other like technologies)</strong></li><li>Data (SQL or similar query language), data constructs (XML, JSON), and ORM tools (Hibernate)</li><li>Hands on experience on NoSQL databases, preferably MongoDB.</li><li>Actual experience developing continuous integration, continuous delivery and continuous deployment pipelines for distributed apps (including use of Jenkins, Artifactory, Gradle)</li><li>Knowledge and experience on approaches and tools for automated testing and monitoring</li><li>Source Control Management (preferably Git/GitHub)</li><li>Experience using API gateways a plus</li></ul>Compensation Data <br><br>Compensation range for this position is $80,800- $120,000 per year, based on experience and qualifications.<br><br>The candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.<br><br><b>Good Work. Good Life. Good Hands®. </b><br><br>As a Fortune 100 company and industry leader, we provide a competitive salary - but that's just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you'll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy. For a full description of Allstate's benefits, <a href=\"http://allstate.jobs/benefits\">visit allstate.jobs/benefits</a> <br><br>Learn more about life at Allstate. Connect with us on <a href=\"http://jb.al.st/BWGk6\">Twitter</a>, <a href=\"http://jb.al.st/BWGka\">Facebook</a>, <a href=\"http://jb.al.st/BWGlO\">Instagram</a> and <a href=\"https://www.linkedin.com/company/allstate/careers\">LinkedIn</a> or watch a <a href=\"http://jb.al.st/BWGpG\">video</a>.<br><br><b>Allstate generally does not sponsor individuals for employment-based visas for this position.</b><br><br>Effective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component. <br><br>For jobs in San Francisco, please click \"<a href=\"https://sfgov.org/olse/sites/default/files/Document/FCO%20Poster%20Set%20All%20Languages%2010%2001%2018.pdf\">here</a>\" for information regarding the San Francisco Fair Chance Ordinance.<br>For jobs in Los Angeles, please click \"<a href=\"http://bca.lacity.org/fair-chance\">here</a>\" for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance. <br><br>To view the \"EEO is the Law\" poster click \"<a href=\"https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf\">here</a>\". This poster provides information concerning the laws and procedures for filing complaints of violations of the laws with the Office of Federal Contract Compliance Programs <br><br>To view the FMLA poster, click \"<a href=\"https://www.dol.gov/whd/regs/compliance/posters/fmlaen.pdf\">here</a>\". This poster summarizing the major provisions of the Family and Medical Leave Act (FMLA) and telling employees how to file a complaint. <br><br>It is the Company's policy to employ the best qualified individuals available for all jobs. Therefore, any discriminatory action taken on account of an employee's ancestry, age, color, disability, genetic information, gender, gender identity, gender expression, sexual and reproductive health decision, marital status, medical condition, military or veteran status, national origin, race (include traits historically associated with race, including, but not limited to, hair texture and protective hairstyles), religion (including religious dress), sex, or sexual orientation that adversely affects an employee's terms or conditions of employment is prohibited. This policy applies to all aspects of the employment relationship, including, but not limited to, hiring, training, salary administration, promotion, job assignment, benefits, discipline, and separation of employment.</p>",
			"name": "Sr. Software Engineer- Remote/ Home Based Worker",
			"type": "external",
			"publication_date": "2022-01-28T23:05:37Z",
			"short_name": "sr-software-engineer-remote-home-based-worker",
			"model_type": "jobs",
			"id": 5575383,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [
				{
					"name": "Fortune 1000",
					"short_name": "fortune-1000-companies"
				}
			],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/allstate/sr-software-engineer-remote-home-based-worker"
			},
			"company": {
				"id": 891,
				"short_name": "allstate",
				"name": "Allstate"
			}
		},
		{
			"contents": "<p><b> Atlassian can hire people in any country where we have a legal entity, assuming candidates have eligible working rights and a sufficient timezone overlap with their team. As our offices re-open, Atlassians can choose to work remotely or return to an office, unless it's necessary for the role to be performed in the office. Interviews and onboarding are conducted virtually, a part of being a distributed-first company. </b><br><br>You are the accountable technical service owner of Atlassian University's end-user training products and systems that support our learner experience. You are an enterprise architect, development, operations, compliance/security manager that lives and breathes customer learning experiences. You will team with your colleagues to define the end-to-end learning experience. You will execute, operate, and improve said vision and lead a team of development contractors to support the work. You will report to the Head of the Atlassian University team.<br><br><b>Enterprise Architect</b><br><br>You are our technical visionary of how our systems and products work with each other to support our learner experience. (Our learner experience refers to how our customers interact with our different Atlassian platforms to access and engage in our training solutions.) Systems include a mixture of homegrown, commercial-off-the-shelf and SaaS vendors that provide the essential capabilities, such as:<br><br>Learning Management Systems (Intellum)<br><br>Training delivery systems<br><br>Certification systems<br><br>Commerce<br><br>Financial<br><br>Marketing/Website<br><br>Analytics<br><br>Gamification<br><br>Stay up to date on all the latest technology trends in this area.<br><br><b>Development Manager</b><br><br>You are the Software Development Manager in the Atlassian University product triad. You will manage a team of offshore developers and team with other software developers at Atlassian to provide in-product add-ons, backend microservices, and SaaS vendor integrations. <br><br>Key technologies include:<br><br> Atlassian Connect <br><br> Atlassian Plugin SDK <br><br>Java<br><br> Node.js<br><br><b>Operations Manager</b><br><br>In addition to being a Development Manager, you are also an Operations Manager...A DevOps Manager if you will. Responsibilities include:<br><br>Monitor and resolve high priority incidents and outages<br><br>Monitor SLAs/SLOs<br><br>Prioritize tech debt in upcoming sprints<br><br>Produce and review operations reports with management<br><br>The team is primarily offshore.<br><br><b>Compliance and Security Manager</b><br><br>Trust and security are core to our value proposition and this role. <br><br>Responsibilities include:<br><br>Monitor and resolve high priority security incidents<br><br>Monitor and resolve vulnerabilities identified by our larger Atlassian security capability<br><br>Create and operate internal controls<br><br>Ensure our Trust Scorecard is &gt;= 90%<br><br>The team is primarily offshore.<br><br><b>Vendor Management</b><br><br>As mentioned above, our learner experience consists of a mix of homegrown, commercial software, and SaaS vendors. Our vendors are key partners in providing a fabulous end-user experience. You will team with them so we can extract the best from them. <br><br>You will partner with your Business Operations peers for:<br><br>Operational reviews<br><br>Product roadmap reviews<br><br>Joint strategy sessions<br><br><b>Accounting</b><br><br>Channel your inner Ben Wyatt and work with our Business Operations peers to make sure the budget is balanced and always optimized for effectiveness. Avoid \"Ice Town.\"<br><br>More about you:<ul><li>8+ years in engineering management following Agile development processes; experience managing remote employees (primarily in the Ukraine)</li><li>Breaking down problems into executable chunks and coordinating multiple engineers to deliver a solution</li><li>Experience setting a high bar for operational excellence across the engineering team, and putting systems in place to measure against that bar</li><li>Experience leading teams executing on product development. Experience in working closely with product management, design, and program management to set vision and strategy for the product</li><li>Demonstrated experience in mentoring and retaining talent</li><li>Experience in AWS technologies like CloudFormation, EC2, ELB, DynamoDB, RDS and more. AWS experience can be substituted with experience in similar public clouds (i.e Azure)</li><li>Strong programming experience in Java or similar languages, and foundation in data structures, algorithms and distributed system</li><li>Prior operations experience with 24x7 SLAs</li><li>Ability to contribute to the technical and business strategy of the team</li><li>Familiarity with enterprise architecture</li><li>Outstanding interpersonal skills: written and verbal, in-person and remote. You have the ability to build a strong partnership at all levels of our team (with technical and non-technical teammates), and have proven leadership skills in listening, influencing and coordinating</li><li>Customer focus; passion for understanding customers and their needs</li><li>BS (or higher) in CS or related field</li></ul>And ideally, we'd hope you'd have:<ul><li>Knowledge of learning management systems</li><li>Knowledge of e-commerce and finance systems</li><li>Knowledge of website and content management systems</li><li>Knowledge of community management systems</li></ul><b>More about our team</b><br><br>You will join our Atlassian University team at a really exciting time! Atlassian is growing rapidly year over year, and we want to scale intelligently while helping our customers unlock value from our products faster. This is an opportunity to play a major role in achieving that goal. We are a small but mighty team of top-tier professionals with diverse skills and work backgrounds. Our team is open, encouraging, focused, located around the globe, and is all about providing outstanding training solutions to our customers!<br><br><b>More about our benefits</b><br><br>Whether you work in an office or a distributed team, Atlassian is highly collaborative and yes, fun! To support you at work (and play) we offer some fantastic perks: ample time off to relax and recharge, flexible working options, five paid volunteer days a year for your favourite cause, an annual allowance to support your learning &amp; growth, unique ShipIt days, a company paid trip after five years and lots more.<br><br><b>More about Atlassian</b><br><br>Creating software that empowers everyone from small startups to the who's who of tech is why we're here. We build tools like Jira, Confluence, Bitbucket, and Trello to help teams across the world become more nimble, creative, and alignedcollaboration is the heart of every product we dream of at Atlassian. From Amsterdam and Austin, to Sydney and San Francisco, we're looking for people who want to write the future and who believe that we can accomplish so much more together than apart. At Atlassian, we're committed to an environment where everyone has the autonomy and freedom to thrive, as well as the support of like-minded colleagues who are motivated by a common goal to: Unleash the potential of every team .<br><br><b>Additional Information</b><br><br>We believe that the unique contributions of all Atlassians is the driver of our success. To make sure that our products and culture continue to incorporate everyone's perspectives and experience we never discriminate on the basis of race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status.<br><br>All your information will be kept confidential according to EEO guidelines.<br><br>If your experience looks a little different from what we've identified and you think you can rock the role, we'd love to learn more about you.<br><br>Learn more about Atlassian's culture, interviewing flow, and hiring process by checking out our Candidate Resource Hub .<br><br>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p>",
			"name": "Engineering Manager, Customer Training Products and Systems",
			"type": "external",
			"publication_date": "2022-01-05T23:55:00Z",
			"short_name": "engineering-manager-customer-training-products-and-systems-0bf486",
			"model_type": "jobs",
			"id": 7787888,
			"locations": [
				{
					"name": "Flexible / Remote"
				},
				{
					"name": "San Francisco, CA"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/atlassian/engineering-manager-customer-training-products-and-systems-0bf486"
			},
			"company": {
				"id": 741,
				"short_name": "atlassian",
				"name": "Atlassian"
			}
		},
		{
			"contents": "<p><b>Job Requisition ID #</b><br><br>21WD53150<br><br><b>Position Overview</b><br><br>As a global leader in 3D design, engineering, and entertainment software, Autodesk helps people imagine, design, and make a better world. Autodesk accelerates better design through an unparalleled depth of experience and a broad portfolio of software to give customers the power to solve their design, business, and environmental challenges. This is an exciting time to join us on our multi-year journey to disrupt the Design to Manufacture world with Fusion 360 by delivering unprecedented value and converging workflows with cloud-based technology. We are rapidly combining many world leading technologies and teams into the Fusion 360 family. The role is in the Fusion Electronics Organization within the Product Design and Manufacturing Solutions division. This team defines and builds the ECAD solution within the Fusion 360 family of products. We are looking for an experienced Software Engineer to help us fulfil the mission of the organization which is to deliver best ECAD/MCAD integration experience in the industry.<br><br><b>Responsibilities</b><br><ul><li>Design,implement, test and maintain features for Fusion 360 based on stakeholders' requirements (our code base is mostly written in C++ and API development can be done with Python or C++)</li><li>Write technical design documents, participate in design and code reviews, develop estimates for tasks and document code</li><li>Work with an extended team of software developers, QAs and product designers in the US and other worldwide engineering sites</li><li>Mentor junior engineers on the team and act as a technical lead in areas of your expertise</li></ul><br><b>Minimum Qualifications</b><br><ul><li>Good professional C++ programming experience</li><li>Current knowledge of C++ standards and specifications</li><li>Outstanding programming, debugging and problem-solving skills</li><li>Familiar with Design Patterns and strong Object-Oriented programming skills</li><li>Knowledge of data structures, algorithms, and STL</li><li>Ability to work well in a team to deliver on team goals</li><li>Good verbal and written communication skills in English</li><li>Ability to learn large software systems quickly</li></ul><br><b>Preferred Qualifications</b><br><ul><li>Experience with the Qt library</li><li>CMake, Bash Script, Python and Jenkins would be a bonus</li></ul><br>At Autodesk, we're building a diverse workplace and an inclusive culture to give more people the chance to imagine, design, and make a better world. Autodesk is proud to be an equal opportunity employer and considers all qualified applicants for employment without regard to race, color, religion, age, sex, sexual orientation, gender, gender identity, national origin, disability, veteran status or any other legally protected characteristic. We also consider for employment all qualified applicants regardless of criminal histories, consistent with applicable law.<br><br><b><b>Are you an existing contractor or consultant with Autodesk? Please search for open jobs and apply internally (not on this external site). If you have any questions or require support, contact Autodesk Careers.</b></b></p>",
			"name": "Software Engineer",
			"type": "external",
			"publication_date": "2021-10-25T11:38:35Z",
			"short_name": "software-engineer-fb3486",
			"model_type": "jobs",
			"id": 7200265,
			"locations": [
				{
					"name": "Flexible / Remote"
				},
				{
					"name": "Krakow, Poland"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Mid Level",
					"short_name": "mid"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/autodesk/software-engineer-fb3486"
			},
			"company": {
				"id": 12024,
				"short_name": "autodesk",
				"name": "Autodesk"
			}
		},
		{
			"contents": "<p>At CrowdStrike we're on a mission - to stop breaches. Our groundbreaking technology, services delivery, and intelligence gathering together with our innovations in machine learning and behavioral-based detection, allow our customers to not only defend themselves, but do so in a future-proof manner. Because of that we've earned numerous honors and top rankings for our technology, organization and talent. Our culture was purpose-built to be remote first, and we offer flexible work arrangements to help our people manage their personal and professional lives in a way that works for them. If you're ready to work on unrivaled technology with a team that makes a difference every day, let's talk.<br><br><b>About the Role:</b><br><br>Help us protect CrowdStrike and its customers from the world's most advanced threats by designing, implementing and supporting identity, access and cryptography systems. CrowdStrike's Product Security team breaks the mold of traditional product security and focuses on active threats to CrowdStrike's products. As a Product Security Engineer, you will perform technical security assessments of current and new systems, monitor for emerging vulnerabilities, create tooling for known gaps, and deploy large-scale security/monitoring systems.<br><br><b>Essential Duties and Responsibilities:</b><ul><li>Automate IAM least-privilege &amp; Crypto operations in multi-tenant environments.</li><li>Be a champion for certificate management, code signing &amp; overall cryptography posture</li><li>Define &amp; drive crypto roadmap in conjunction with engineering &amp; security leaders</li></ul><b>What You'll Need:</b><ul><li>Experience working in an engineering role implementing and supporting security systems.</li><li>Experience working with Linux and/or other Unix-like variants.</li><li>Capability to script in common languages like shell, Python, Perl, Ruby, etc.</li><li>Domain knowledge of TCP/IP, cryptography, IAM and systems hardening.</li><li>Experience working in large-scale cloud platforms with highly concurrent systems.</li><li>Self-motivated to identify security problems and engage with teams to find solutions.</li><li>Efficient communicator with strong writing skills, experience working remotely.</li><li>Familiarity with TLS best practices, ciphers, public key infrastructure implementations.Education/Certifications</li><li>Bachelor's degree in computer science or other equivalent disciplines</li><li>Bachelor's degree in computer science or other equivalent disciplines</li></ul>#LI-NT1<br><br>#LI-MK1<br><br>#LI-Remote<br><br><b>Benefits of Working at CrowdStrike:</b><ul><li>Remote-friendly culture</li><li>Market leader in compensation and equity awards</li><li>Competitive vacation and flexible working arrangements</li><li>Comprehensive health benefits + 401k plan</li><li>Paid Parental Leave, including adoption</li><li>Wellness programs</li><li>A variety of professional development and mentorship opportunities</li><li>Open offices have stocked kitchens, coffee, soda and treats</li></ul>We are committed to building an inclusive culture of belonging that not only embraces the diversity of our people but also reflects the diversity of the communities in which we work and the customers we serve. We know that the happiest and highest performing teams include people with diverse perspectives that encourage new ways of solving problems, so we strive to attract and develop talent from all backgrounds and create workplaces where everyone feels seen, heard and empowered to bring their full, authentic selves to work.<br><br>CrowdStrike is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.<br><br>CrowdStrike, Inc. is committed to fair and equitable compensation practices. For applicants in Colorado the salary range is $136,702 - $205,052 + bonus + equity + benefits. A candidate's salary is determined by various factors including, but not limited to, relevant work experience, skills, and certifications. The salary range may differ in other states.</p>",
			"name": "Sr. Product Security Engineer – IAM & Crypto(Remote)",
			"type": "external",
			"publication_date": "2021-10-21T23:48:13Z",
			"short_name": "sr-product-security-engineer-iam-cryptoremote",
			"model_type": "jobs",
			"id": 6293987,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Senior Level",
					"short_name": "senior"
				}
			],
			"tags": [],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/crowdstrike/sr-product-security-engineer-iam-cryptoremote"
			},
			"company": {
				"id": 12273,
				"short_name": "crowdstrike",
				"name": "CrowdStrike"
			}
		},
		{
			"contents": "<p>Are you interested in building products used by more than a billion people? Do you like shipping code at a rapid pace? Facebook is seeking an experienced Front End Engineer that is passionate about building mobile and desktop web applications. This position is full-time.<ul><li>Implement the features and user interfaces of Facebook products like News Feed</li><li>Architect efficient and reusable front-end systems that drive complex web applications</li><li>Complete medium to large features (each with many tasks) independently without guidance</li><li>Identify and drive changes as needed for assigned codebase, product area and/or systems</li><li>Collaborate with Product Designers, Product Managers, and Software Engineers to deliver compelling user-facing products</li><li>Identify and resolve performance and scalability issues</li></ul><ul><li>JavaScript experience, including concepts like asynchronous programming, closures, types, and ES6</li><li>HTML/CSS experience, including concepts like layout, specificity, cross browser compatibility, and accessibility</li><li>Experience with browser APIs and optimising front end performance</li></ul><ul><li>BSc or MSc in Computer Science or related field (or equivalent industry experience)</li><li>Experience with React</li></ul>Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.</p>",
			"name": "Front End Engineer",
			"type": "external",
			"publication_date": "2022-01-29T23:12:16Z",
			"short_name": "front-end-engineer-bcfbfe",
			"model_type": "jobs",
			"id": 7503945,
			"locations": [
				{
					"name": "Flexible / Remote"
				}
			],
			"categories": [
				{
					"name": "Software Engineer"
				}
			],
			"levels": [
				{
					"name": "Mid Level",
					"short_name": "mid"
				}
			],
			"tags": [
				{
					"name": "Fortune 1000",
					"short_name": "fortune-1000-companies"
				}
			],
			"refs": {
				"landing_page": "https://www.themuse.com/jobs/meta/front-end-engineer-bcfbfe"
			},
			"company": {
				"id": 659,
				"short_name": "meta",
				"name": "Meta"
			}
		}
	],
	"aggregations": {}
}
